<?php
/**
 *
 */

return [
    '200' => 'success',
    '500' => '服务器错误',

    //抛异常错误
    '901' => '获取列表数据失败',
    '902' => '获取数据详情失败',
    '903' => '获取数据失败',
    '904' => '新增数据失败',
    '905' => '修改数据失败',
    '906' => '删除数据失败',
    '907' => '保存数据失败',
    '908' => '数据格式错误:',

    '10801' => '保养项目格式错误',
    '10802' => '此养护车辆信息不存在',
    '10803' => '此养护车辆信息不存在，请先新增',
    '10804' => '品牌车系信息不一致',
    '10805' => '此养护车辆信息已存在，请勿重复添加',

    '11501' => '任务不存在',

    //登录
    '1001'=> 'Unauthorized.',
    '1002'=> 'token 过期,重新登录',
    '1003'=> '请输入正确的手机号码',
    '1004'=> '账号被冻结',
    '1005'=> '验证码有误，请重新输入',
    '1006'=> '手机格式不正确',
    '1007'=> '今日短信已达上限',
    '1008'=> '发送短信失败',
    '1009'=> '密码有误，请重新输入',

    //供货管理
    '1301'=> '设备名称重复',
    '1302'=> '设备不存在',
    '1303'=> '请输入设备类型',

    //服务推送
    '1401'=> '集团用户无法添加服务项目',
    '1402'=> '服务推送不可超过5个',
    '1403'=> '无法操作其他渠道的推送方案',
    '1404'=> '推送方案不存在',
    '1405'=> '该部门名称已存在',
    '1406'=> '用户非渠道人员,无法新增/编辑',
    '1407'=> '不能将管理员添加到服务团队',
    '1408'=> '不能将管理员添加至服务团队',
    '1409'=> '服务团队不存在',
    '1410'=> '用户非渠道人员,无法操作',
    '1411'=> '服务管理方案未找到',

    //品牌/车系
    '1501'=> '品牌不存在',
    '1502'=> 'failed',
    '1503'=> '修改存在相同的值',
    '1504'=> '车系不存在',
    '1505'=> '车型不存在',

    //首页分析
    '3001'=>'用户不存在',
    '3002'=>'渠道信息有误',
    '3003'=> '版本信息不存在',
    '3004'=> '版本信息编辑失败',
    '3005' => '登录失败',

    //表情管理
    '1601'=> '分类不存在',
    '1602'=> '已存在相同名字',
    '1603'=> '缺少参数',
    '1604'=> '表情不存在',

    //意见反馈
    '1701'=> '详情不存在',
    '1702'=> '已删除的意见反馈无法回复',
    '1703'=> '回复不存在',
    '1704'=> '回复已被删除',
    '1705'=> '意见反馈不存在',
    '1706'=> '意见反馈已被删除',

];
